<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'שם',
    'column.guard_name' => 'שם השומר',
    'column.roles' => 'תפקידים',
    'column.permissions' => 'הרשאות',
    'column.updated_at' => 'עודכן ב',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'שם',
    'field.guard_name' => 'שם השומר',
    'field.permissions' => 'הרשאות',
    'field.select_all.name' => 'בחר הכל',
    'field.select_all.message' => 'אפשר את כל ההרשאות כרגע <span class="text-primary font-medium">מופעל</span> לתפקיד זה',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'הגדרות',
    'nav.role.label' => 'תפקידים והרשאות',
    'nav.role.icon' => null,
    'resource.label.role' => 'תפקיד',
    'resource.label.roles' => 'תפקידים',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'ישויות',
    'resources' => 'משאבים',
    'widgets' => "ווידג'טים",
    'pages' => 'דפים',
    'custom' => 'הרשאות מותאמות אישית',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'אין לך אישור גישה',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'הצגה',
        'view_any' => 'הצגה לכולם',
        'create' => 'יצירה',
        'update' => 'עדכון',
        'delete' => 'מחיקה',
        'delete_any' => 'מחיקה לכולם',
        'force_delete' => 'מחיקה סופית',
        'force_delete_any' => 'מחיקה סופית לכולם',
        'restore' => 'שחזור',
        'reorder' => 'מיון מחדש',
        'restore_any' => 'שחזור לכולם',
        'replicate' => 'שכפול',
    ],
];
